thihaElec/my-git/KL25Z-KDS/FDRM_KL25Z_ESP8266_GroveStreams/Sources/Appliction.c
/*
 * Appliction.c
 *
 *  Created on: 2 Jan, 2015
 *      Author: kzw
 */

#include "PE_Types.h"
#include "CLS1.h"
#include "WAIT1.h"
#include "Shell.h"
#include "UTIL1.h"
#include "ESP8266.h"
#include "LEDR.h"
#include "LEDG.h"
#include "AS2.h"
#include "GroveStreams.h"
#include "DTH.h"

static uint8_t APP_EspMsgBuf[512]; /* buffer for messages from ESP8266 */
static uint8_t temp,humidity;

static uint8_t SendWebPage(uint8_t ch_id, bool ledIsOn, uint8_t temperature, const CLS1_StdIOType *io) {
  static uint8_t http[1024];
  uint8_t buf[16];
  uint8_t res = ERR_OK;

  /* construct web page content */
  UTIL1_strcpy(http, sizeof(http), (uint8_t*)"HTTP/1.0 200 OK\r\nContent-Type: text/html\r\nPragma: no-cache\r\n\r\n");
  UTIL1_strcat(http, sizeof(http), (uint8_t*)"<html>\r\n<body>\r\n");
  UTIL1_strcat(http, sizeof(http), (uint8_t*)"<title>ESP8266 Web Server</title>\r\n");
  UTIL1_strcat(http, sizeof(http), (uint8_t*)"<h2>Web Server using KL25Z/ESP8266 (Thiha Electronics)</h2>\r\n");
  UTIL1_strcat(http, sizeof(http), (uint8_t*)"<br /><hr>\r\n");
  UTIL1_strcat(http, sizeof(http), (uint8_t*)"<p><form method=\"POST\"><strong>Temp: <input type=\"text\" size=2 value=\"");
  UTIL1_strcatNum8s(http, sizeof(http), temperature);
  UTIL1_strcat(http, sizeof(http), (uint8_t*)"\"> <sup>O</sup>C");
  if (ledIsOn) {
    UTIL1_strcat(http, sizeof(http), (uint8_t*)"<p><input type=\"radio\" name=\"radio\" value=\"0\" >Red LED off");
    UTIL1_strcat(http, sizeof(http), (uint8_t*)"<br><input type=\"radio\" name=\"radio\" value=\"1\" checked>Red LED on");
  } else {
    UTIL1_strcat(http, sizeof(http), (uint8_t*)"<p><input type=\"radio\" name=\"radio\" value=\"0\" checked>Red LED off");
    UTIL1_strcat(http, sizeof(http), (uint8_t*)"<br><input type=\"radio\" name=\"radio\" value=\"1\" >Red LED on");
  }
  UTIL1_strcat(http, sizeof(http), (uint8_t*)"</strong><p><input type=\"submit\"></form></span>");
  UTIL1_strcat(http, sizeof(http), (uint8_t*)"</body>\r\n</html>\r\n");

  res = ESP_PrepareMsgSend(ch_id, UTIL1_strlen(http), 3000, io);
  if (res!=ERR_OK) {
    if (io!=NULL) {
      CLS1_SendStr("INFO: TIMEOUT, closing connection!\r\n", io->stdOut);
    }
  } else {
    if (io!=NULL) {
      CLS1_SendStr("INFO: Sending http page...\r\n", io->stdOut);
    }
    UTIL1_strcat(http, sizeof(http), "\r\n\r\n"); /* need to add this to end the command! */
    res = ESP_SendATCommand(http, NULL, 0, NULL, ESP_DEFAULT_TIMEOUT_MS, io);
    if (res!=ERR_OK) {
      CLS1_SendStr("Sending page failed!\r\n", io->stdErr); /* copy on console */
    } else {
      for(;;) { /* breaks */
        res = ESP_ReadCharsUntil(buf, sizeof(buf), '\n', 1000);
        if (res==ERR_OK) { /* line read */
          if (io!=NULL) {
            CLS1_SendStr(buf, io->stdOut); /* copy on console */
          }
        }
        if (UTIL1_strncmp(buf, "SEND OK\r\n", sizeof("SEND OK\r\n")-1)==0) { /* ok from module */
          break;
        }
      }
    }
  }
  return res;
}

static void WebProcess(void) {
  uint8_t res=ERR_OK;
  bool isGet;
  uint8_t ch_id=0;
  uint16_t size=0;
  const uint8_t *p;
  const CLS1_StdIOType *io;

  if (ESP_IsServerOn()) {
    io = CLS1_GetStdio();
    res = ESP_GetIPD(APP_EspMsgBuf, sizeof(APP_EspMsgBuf), &ch_id, &size, &isGet, 1000, io);
    if (res==ERR_OK) {
      if (isGet) { /* GET: put web page */
        res = SendWebPage(ch_id, LEDR_Get()!=FALSE, temp /*dummy temperature*/, io);
        if (res!=ERR_OK && io!=NULL) {
          CLS1_SendStr("Sending page failed!\r\n", io->stdErr); /* copy on console */
        }
      } else { /* POST: received info */
        int pos;

        pos = UTIL1_strFind(APP_EspMsgBuf, "radio=");
        if (pos!=-1) { /* found */
          if (UTIL1_strncmp(&APP_EspMsgBuf[pos], "radio=0", sizeof("radio=0")-1)) {
            LEDR_On();
          } else if (UTIL1_strncmp(&APP_EspMsgBuf[pos], "radio=1", sizeof("radio=1")-1)) {
            LEDR_Off();
          }
        }
        res = SendWebPage(ch_id, LEDR_Get()!=FALSE, temp /*dummy temperature*/, io);
        if (res!=ERR_OK && io!=NULL) {
          CLS1_SendStr("Sending page failed!\r\n", io->stdErr); /* copy on console */
        }
      }
      CLS1_SendStr("INFO: Closing connection...\r\n", io->stdOut);
      res = ESP_CloseConnection(ch_id, io, ESP_DEFAULT_TIMEOUT_MS);
    }
  } else { /* copy messages we receive to console */
    while (AS2_GetCharsInRxBuf()>0) {
      uint8_t ch;

      (void)AS2_RecvChar(&ch);
      CLS1_SendChar(ch);
    }
  }
}


void APP_Run(void) {
  CLS1_ConstStdIOType *io;


  WAIT1_Waitms(1000); /* wait after power-on */
  ESP_Init();
  SHELL_Init();
  GROVESTREAMS_Init();
  io = CLS1_GetStdio();
  CLS1_SendStr("\r\n------------------------------------------\r\n", io->stdOut);
  CLS1_SendStr("ESP8266 with FRDM-KL25Z\r\n", io->stdOut);
  CLS1_SendStr("------------------------------------------\r\n", io->stdOut);
  CLS1_PrintPrompt(io);

  DHT_read(); // first data always have error
  WAIT1_Waitms(2000);

  while (ESP_IsServerOn()==TRUE);

  for(;;) {
	  LEDG_On();
//    temp = DHT_read();
//    WebProcess();
//    SHELL_Parse();
//    WAIT1_Waitms(10);

//    temp = DHT_read();

    DHT_read();
    temp = (uint8_t)DHT_read_temp();
    humidity = (uint8_t)DHT_read_humidity();


    //    CLS1_SendStr("// 3.1 : ", io->stdOut);
    GROVESTREAMS_SendValue(temp,humidity, io);
//	CLS1_SendNum16u(temp, io->stdOut);
	LEDG_Off();
    WAIT1_Waitms(10000);

/*    WAIT1_Waitms(60000);  //5 mins
    WAIT1_Waitms(60000);
    WAIT1_Waitms(60000);
    WAIT1_Waitms(60000);
    WAIT1_Waitms(60000);

    WAIT1_Waitms(60000);  //5 mins
    WAIT1_Waitms(60000);
    WAIT1_Waitms(60000);
    WAIT1_Waitms(60000);
    WAIT1_Waitms(60000);
*/
//    LEDG_Neg();
  }
}

